`timescale 1ns / 1ps

module Verilog2;


    // הגדרת אותות הבדיקה (החוטים במעבדה)
    reg [3:0] in;
    reg [1:0] sel;
    wire out;


    // חיבור המוקס ללוח הבדיקות
    Assignment2DHL uut (
        .in(in),
        .sel(sel),
        .out(out)
    );


    // תהליך הבדיקה האוטומטי
    initial begin


        // הגדרת ערך הכניסות ל-1010 בינארי
        in = 4'b1010; 
        

        // המצב הראשון: בורר על 00
        sel = 2'b00; 
        #10; 


        // המצב השני: בורר על 01
        sel = 2'b01; 
        #10; 


        // המצב השלישי: בורר על 10
        sel = 2'b10; 
        #10; 


        // המצב הרביעי: בורר על 11
        sel = 2'b11; 
        #10; 


        // עצירת הסימולציה והשארת חלון הגרפים פתוח
        $stop; 


    end

endmodule