`timescale 1ns / 1ps

module Verilog2;

    // הגדרת אותות הבדיקה (החוטים במעבדה)
    reg [3:0] in;
    reg [1:0] sel;
    wire out;

    // חיבור המוקס ללוח הבדיקות
    Assignment2DHL uut (
        .in(in),
        .sel(sel),
        .out(out)
    );

    // תהליך הבדיקה האוטומטי
    initial begin
        // קביעת ערכים קבועים לכניסות (1010 בדינאמי)
        in = 4'b1010; 
        
        // שינוי מצבי הבורר כל 10 ננו-שניות כדי לבדוק את כל הכניסות
        sel = 2'b00; #10; // out יקבל את in[0] שהוא 0
        sel = 2'b01; #10; // out יקבל את in[1] שהוא 1
        sel = 2'b10; #10; // out יקבל את in[2] שהוא 0
        sel = 2'b11; #10; // out יקבל את in[3] שהוא 1

        // עוצרים את הסימולציה ומשאירים את חלון הגרפים פתוח
        $stop; 
    end

endmodule